9/data/attachments/4e5469bd5ff7b5fa.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6e2c9cea-0d10-4338-8b40-66eaf03f2c02</nif:username>
            <nif:friendToBeAdded>Joseph_their_Friend_46087_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>